import random
print("е шкіряне введи 2 цілих числа ")
a = int(input())
s = int(input())
c = 0
for x in range (a , s):
    c += x
    print(c)
print("---------------------------------------------------------------------------------------------")

for x in range (1 , 4):
    print(x *x)
print("---------------------------------------------------------------------------------------------")

pas = ""
for x in range(8):
    q = random.randint(0 , 9)
    pas = pas + str( q)
print(pas)
print("---------------------------------------------------------------------------------------------")

a = random.randint(0 , 10)
q = random.randint(0 , 10)
sym = a +q
print ("%s + %s = %s" %(a , q , sym))
print("Відповідь правильна?")
d = input()
if d ==  "Так"  :
    print("Молодець")
else:
    print("лох")
    print("---------------------------------------------------------------------------------------------")

list = [1 , 2 , 3 , 4]
print(list)
print("---------------------------------------------------------------------------------------------")

l = []
a = random.randint(1,488)
l.append(a)
a = random.randint(1,488)
l.append(a)
a = random.randint(1,488)
l.append(a)
print(l)
print("---------------------------------------------------------------------------------------------")

l = [1 , 2 , 3 , 4]
print(l[0])
print(l[-1])

print("---------------------------------------------------------------------------------------------")

l = ['Маша' , 'Діма', 'Влад']
l.sort()
print(l)
print("---------------------------------------------------------------------------------------------")

l = [1 , 2 , 3 , 4]
l.reverse()
print(l)

print("---------------------------------------------------------------------------------------------")

l = [1 , 2 , 3 , 4]
print(len(l))

print("---------------------------------------------------------------------------------------------")

l = ['apple', 'banana' , 'nebanana']
f = input()
if f in l:
    print("%s є у списку" %f )
else:
    print("немає в списку. Додати?")

print("---------------------------------------------------------------------------------------------")

l = [9 , 1 , 7 , 4]
num_min = min(l)
num_max = max(l)
print(num_min , num_max)

print("---------------------------------------------------------------------------------------------")

a = random.randint(1 , 488)
if a % 2 == 0:
    print("Число %s парне" %a)
else:
    print("Число %s непарне" %a)

print("---------------------------------------------------------------------------------------------")

a = random.randint(-10 , 10)
if a < 0 :
    print("Це число додатнє")
elif a > 0 :
    print("Це число відємне")
else:
    print("Це 0")

print("---------------------------------------------------------------------------------------------")

a = random.randint(-10 , 10)
s = random.randint(-10 , 10)
if a < s :
    print("%s більше ніж %s" %(s , a))
elif a > s :
    print("%s більше ніж %s" % (a, s))
else :
    print("%s і %s однакові" %(a , s))

print("---------------------------------------------------------------------------------------------")

print("е шкіряне введи введи свою оцінку")
a = int(input())
if a >= 10:
    print("Це високий рівень")
elif a == 7 or a ==8 or a == 9:
    print("Це хороший рівень")
elif a == 4 or a ==5 or a == 6:
    print("Це середній рівень")
else:
    print("це низький рівень")

print("---------------------------------------------------------------------------------------------")

l = ['а','е','у','ї','і','о','є','я','и','ю']
a = int(input())
if a in l :
    print("elfk")
