import random
answer = ('в тебе хароший настрій','в тебе поганий настрій','ти злий ','ти не виспався ','в тебе багато сил')
mistse = ('ти хочеш погуляти','ти хочеш поспати','ти хочеш пограти','ти хочеш покататися','ти хочеш сходити в кіно')
print("Не хочеш зіграти в гру?")
answer1 = input()
chuslo = 0
if answer1 == "ne" or answer1 == "ні" or answer1 == "Ні" :
    print("Добре, бувай")
elif answer1 == "da" or answer1 == "так" or answer1 == "Так" :
    print("Супер, тоді давай грати")
    print("Але спочатку вкажи свій вік")
    vik = int(input())
    if vik <= 10 :
        print("Ану бігом мити ноги та спати")
    elif vik >= 11 and vik <=20 :
        print("Добре граємо")
        print("ти кажеш коли ти проснувсяб а я стараюся вгадати який в тебе настрій")
        print("В тебе 5 спроб")

    elif vik >=21 :
        print("Ну ти й дід, але граємо")
        print("ти кажеш коли ти проснувсяб а я стараюся вгадати який в тебе настрій")
        print("В тебе 10 спроб")
        q = int

else:
    print("lox")


